artillery/artillery.yaml
config:
  target: 'http://localhost:3002'
  phases:
    - duration: 15
      arrivalRate: 600
  processor: './randomPhotoPost.js'
scenarios:
  - weight: 99/1000
    flow:
    - loop:
      - function: "postPhoto"
      - post:
          url: "/photo"
          json:
            r_id: "{{ $randomNumber(1,10000000) }}"
            url: "{{ url }}"
            username: "{{ username }}"
            date: "{{ date }}"
      count: 5
  - weight: 900/1000
    flow:
    - loop:
      - get:
          url: "/API/restaurant/photo/{{ $randomNumber(1,10000000) }}"
      count: 10
  - weight: 1/1000
    flow:
    - loop:
      - function: "flagPhoto"
      - post:
          url: "/flag"
          json:
            id: "{{ id }}"
            reason: "{{ reason }}"
            date: "{{ date }}"
      count: 2